tukano-artillery-tests/logs/db-hibernate-33.txt
--------------------------------
Summary report @ 00:44:47(+0000)
--------------------------------

http.codes.200: ................................................................ 4950
http.codes.204: ................................................................ 2970
http.downloaded_bytes: ......................................................... 391738
http.request_rate: ............................................................. 248/sec
http.requests: ................................................................. 7920
http.response_time:
  min: ......................................................................... 86
  max: ......................................................................... 583
  mean: ........................................................................ 166
  median: ...................................................................... 149.9
  p95: ......................................................................... 278.7
  p99: ......................................................................... 424.2
http.response_time.2xx:
  min: ......................................................................... 86
  max: ......................................................................... 583
  mean: ........................................................................ 166
  median: ...................................................................... 149.9
  p95: ......................................................................... 278.7
  p99: ......................................................................... 424.2
http.responses: ................................................................ 7920
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/likes?pwd=pwd.codes.200: ..... 990
plugins.metrics-by-endpoint./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd...  990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/feed?pwd=pwd.codes.200: .. 990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/followers?pwd=pwd.code...  990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts.codes.200: ........ 990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/shorts?pwd=pwd.codes.204:  990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}/{{ random_user_id }}/f...  990
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd=pwd.codes.200: ....... 990
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/likes?pwd=pwd:
  min: ......................................................................... 120
  max: ......................................................................... 498
  mean: ........................................................................ 159.9
  median: ...................................................................... 149.9
  p95: ......................................................................... 237.5
  p99: ......................................................................... 301.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ id }}/{{ userId }}/likes?pwd=pwd:
  min: ......................................................................... 87
  max: ......................................................................... 470
  mean: ........................................................................ 158.8
  median: ...................................................................... 149.9
  p95: ......................................................................... 223.7
  p99: ......................................................................... 290.1
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/feed?pwd=pwd:
  min: ......................................................................... 125
  max: ......................................................................... 518
  mean: ........................................................................ 185.6
  median: ...................................................................... 156
  p95: ......................................................................... 354.3
  p99: ......................................................................... 468.8
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/followers?pwd=pwd:
  min: ......................................................................... 99
  max: ......................................................................... 407
  mean: ........................................................................ 155.7
  median: ...................................................................... 147
  p95: ......................................................................... 228.2
  p99: ......................................................................... 308
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts:
  min: ......................................................................... 100
  max: ......................................................................... 461
  mean: ........................................................................ 160.9
  median: ...................................................................... 149.9
  p95: ......................................................................... 262.5
  p99: ......................................................................... 308
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/shorts?pwd=pwd:
  min: ......................................................................... 101
  max: ......................................................................... 583
  mean: ........................................................................ 176.8
  median: ...................................................................... 153
  p95: ......................................................................... 301.9
  p99: ......................................................................... 478.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}/{{ random_user_id }}/followers?pwd=pwd:
  min: ......................................................................... 86
  max: ......................................................................... 514
  mean: ........................................................................ 168.4
  median: ...................................................................... 147
  p95: ......................................................................... 295.9
  p99: ......................................................................... 487.9
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd=pwd:
  min: ......................................................................... 88
  max: ......................................................................... 526
  mean: ........................................................................ 162.4
  median: ...................................................................... 147
  p95: ......................................................................... 278.7
  p99: ......................................................................... 407.5
vusers.completed: .............................................................. 990
vusers.created: ................................................................ 990
vusers.created_by_name.DB Storage: ............................................. 990
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 1554.5
  max: ......................................................................... 3481.9
  mean: ........................................................................ 1865.7
  median: ...................................................................... 1686.1
  p95: ......................................................................... 2836.2
  p99: ......................................................................... 3134.5